app/controllers/bookings_controller.rb

SELECT * FROM "bookings" WHERE (arrival_date <= '2009-07-27' and departure_date > '2009-07-27') ORDER BY arrival_date, departure_date
SELECT * FROM "accomm_types" WHERE ("accomm_types"."id" = 1)
---
  def index
    @bookings = Booking.all(:order => "arrival_date, departure_date")
    @availMatrix = Booking.availRange(Date.new(2009, 7, 27),Date.new(2009, 8, 7))
    @displayAccommTypes = AccommType.find(:all)

SELECT * FROM "bookings" WHERE ("bookings"."id" = 1)
---
  def show
    @booking = Booking.find(params[:id])

INSERT INTO "bookings" ("arrival_date", "created_at", "updated_at", "bunks", "departure_date", "status") VALUES('2009-07-30', '2009-07-30 12:26:43', '2009-07-30 12:26:43', 4, '2009-08-12', 'Pencil')
---
  def create
    @booking = Booking.new(params[:booking])

    respond_to do |format|
      if @booking.save